In [ ]:
#all libraries that need to be used in case miss somewhere

import pandas as pd

# TITLE_CREW

Dataset:
*   `tconst`: alphanumeric unique identifier of the title
*   `directors`: (array of nconsts) director(s) of the given title
*   `writers`: (array of nconsts) writer(s) of the given title

A **'\N'** is used to denote a particular field is missing or null for that title/name.

In [ ]:
#MAIN DIRECTORS, ONLY WITH REFERENCE TO TABLE CREW 
import pandas as pd

title_crew = pd.read_csv("https://datasets.imdbws.com/title.crew.tsv.gz", sep = "\t")

title_crew.head()

#title_crew.info(verbose = True, null_counts = True) #verbose and null_counts is to show the column Non-Null Count

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N
3  tt0000004  nm0721526      \N
4  tt0000005  nm0005690      \N

In [ ]:
title_crew.info(verbose = True, null_counts = True) #verbose and null_counts is to show the column Non-Null Count

#### all datatypes seem CORRECT #### NO MISSING values as well ####

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8333396 entries, 0 to 8333395
Data columns (total 3 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   tconst     8333396 non-null  object
 1   directors  8333396 non-null  object
 2   writers    8333396 non-null  object
dtypes: object(3)
memory usage: 190.7+ MB

In [ ]:
title_crew.describe() #doesn't need to be used in this case

#title_crew['directors'].mean() ## maybe to check the average number of directors by movie?!
                                ### the same can be done to the writers?!

In [ ]:
#check for unique values

print(title_crew['tconst'].unique(), '\n')

print(title_crew['directors'].unique(), '\n')

print(title_crew['writers'].unique())

['tt0000001' 'tt0000002' 'tt0000003' ... 'tt9916852' 'tt9916856'
 'tt9916880']

['nm0005690' 'nm0721526' 'nm0005690,nm0374658' ... 'nm10538612'
 'nm10538639' 'nm10538645']

['\\N' 'nm0085156' 'nm0410331' ... 'nm10538639'
 'nm6687687,nm10538642,nm9641593,nm10538643' 'nm6951431']

In [ ]:
#check value_counts() for each element

print(title_crew['tconst'].value_counts(), '\n') #all id's are single and unique

print(title_crew['directors'].value_counts(), '\n') ## a lot of '\N'

print(title_crew['writers'].value_counts()) ### a lot of '\N'

tt0635759     1
tt2126130     1
tt11124706    1
tt0489082     1
tt6879186     1
             ..
tt8254800     1
tt0311174     1
tt9259194     1
tt0192036     1
tt6826098     1
Name: tconst, Length: 8333396, dtype: int64

\N                                                      3504881
nm0565214                                                  5968
nm0022750                                                  5902
nm0600353                                                  5015
nm5727175                                                  4889
                                                         ...
nm12936821,nm8864559,nm12829534,nm9552309,nm12936820          1
nm7231120                                                     1
nm2142064                                                     1
nm7068623,nm7169235,nm5834325,nm4208007                       1
nm7399463                                                     1
Name: directors, Length: 834595, dtype: int64

\N                                         4066163
nm6352729                                    10926
nm0934807                                     9467
nm7370686                                     7174
nm5042664                                     6342
                                            ...
nm4014850                                        1
nm0263422                                        1
nm1586921                                        1
nm0024589,nm0133153,nm0545527,nm0582706          1
nm3327872,nm1600153                              1
Name: writers, Length: 1144537, dtype: int64

In [ ]:
# change columns name 'tconst' to 'title_id'

title_crew.rename(columns = {'tconst':'title_id'}, inplace = True)

title_crew.head()

In [ ]:
# Dataframe with missing values on directors and writers
## Not possible to do because there is no 'NaN'. there is only '\N' as missing values

#title_crew.isna().sum()

# **Maybe divide movies in categories by number of directors?!**

**NEED TO KNOW what to do with the '\N' values. If we replace it by NaN or not?!**

# TITLE_PRINCIPALS
Dataset:

*   `tconst`: alphanumeric unique identifier of the title
*   `ordering`: a number to uniquely identify rows for a given titleId
*   `nconst`: alphanumeric unique identifier of the name/person
*   `category`: the category of job that person was in
*   `job`: the specific job title if applicable, else '\N'
*   `characters`: the name of the character played if applicable, else '\N'

A **'\N'** is used to denote a particular field is missing or null for that title/name.

In [ ]:
import pandas as pd

# Contains the principal cast/crew for titles

title_principals = pd.read_csv("https://datasets.imdbws.com/title.principals.tsv.gz", sep = "\t")

title_principals.rename(columns = {'tconst':'title_id'}, inplace = True)

title_principals.head()

#title_principals.info(verbose = True, null_counts = True) #verbose and null_counts is to show the column Non-Null Count

    title_id  ordering  ...                      job characters
0  tt0000001         1  ...                       \N   ["Self"]
1  tt0000001         2  ...                       \N         \N
2  tt0000001         3  ...  director of photography         \N
3  tt0000002         1  ...                       \N         \N
4  tt0000002         2  ...                       \N         \N

[5 rows x 6 columns]

In [ ]:
title_principals.info(verbose = True, null_counts = True) #verbose and null_counts is to show the column Non-Null Count

#title_principals.dtypes #can be used but the info() will give the same result

#### all datatype seem correct #### NO MISSING values as well ####

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47283330 entries, 0 to 47283329
Data columns (total 6 columns):
 #   Column      Non-Null Count     Dtype
---  ------      --------------     -----
 0   tconst      47283330 non-null  object
 1   ordering    47283330 non-null  int64
 2   nconst      47283330 non-null  object
 3   category    47283330 non-null  object
 4   job         47283330 non-null  object
 5   characters  47283330 non-null  object
dtypes: int64(1), object(5)
memory usage: 2.1+ GB

In [ ]:
title_principals.describe() #don't need to be used

In [ ]:
#check for unique values

print(title_principals['tconst'].unique(), '\n')

print(title_principals['ordering'].unique(), '\n') #maximum ordering is 10

print(title_principals['nconst'].unique(), '\n')

print(title_principals['category'].unique(), '\n') #what is 'self'? maybe a documentary about himself?

print(title_principals['job'].unique(), '\n') ## '\\N' and some strange data like: 'short story "Your Iron Lady"' or 'original screenplay "Teorie tygra"'

print(title_principals['characters'].unique()) ### what is 'self'? maybe a documentary about himself?
                                              #### presence of "\\N"

['tt0000001' 'tt0000002' 'tt0000003' ... 'tt9916852' 'tt9916856'
 'tt9916880']

[ 1  2  3  4  5  6  7  8 10  9]

['nm1588970' 'nm0005690' 'nm0374658' ... 'nm10538645' 'nm6951431'
 'nm10538653']

['self' 'director' 'cinematographer' 'composer' 'producer' 'editor'
 'actor' 'actress' 'writer' 'production_designer' 'archive_footage'
 'archive_sound']

['\\N' 'director of photography' 'producer' ...
 "based upon 'Star Trek Enterprise' created by"
 'short story "Your Iron Lady"' 'original screenplay "Teorie tygra"']

['["Self"]' '\\N' '["Blacksmith"]' ... '["Tomeka"]' '["Alasia"]'
 '["Judah Harris"]']

In [ ]:
#check value_count of each element

print(title_principals['tconst'].value_counts(), '\n') # some id's repeat but the maximum is 10 ## these ones might can be join together

print(title_principals['ordering'].value_counts(), '\n')

print(title_principals['nconst'].value_counts(), '\n')

print(title_principals['category'].value_counts(), '\n') #presence of 'self'

print(title_principals['job'].value_counts(), '\n') ## a lot of '\N' and 'based on', 'book blabla' or even short story

print(title_principals['characters'].value_counts()) ### a lot of '\N', different 'SELF' and 
                          #other names (probably the name of character in movie)

tt9831086     10
tt7684110     10
tt0227887     10
tt11355586    10
tt1053644     10
              ..
tt13527510     1
tt15016808     1
tt10649078     1
tt9758752      1
tt1548459      1
Name: tconst, Length: 7569644, dtype: int64

1     7569644
2     6623974
3     5877811
4     5298732
5     4777887
6     4280053
7     3841309
8     3430157
9     2998719
10    2585044
Name: ordering, dtype: int64

nm0438506     15191
nm0914844     14707
nm6352729     12551
nm1966600     12453
nm0251041     12286
              ...
nm1653316         1
nm9901348         1
nm8175187         1
nm10396296        1
nm9415924         1
Name: nconst, Length: 4558812, dtype: int64

actor                  10667057
self                    8225215
actress                 8099043
writer                  6304634
director                5477038
producer                2981424
cinematographer         1662531
composer                1660775
editor                  1574704
production_designer      332834
archive_footage          295301
archive_sound              2774
Name: category, dtype: int64

\N                                                               39662327
producer                                                          2925774
writer                                                             867931
creator                                                            472579
written by                                                         438052
                                                                   ...
short story "Il libro è chiuso"                                         1
book "E=mc²: A Biography of the World's Most Famous Equation"           1
essay Why Is America What It Is?                                        1
based on the 1981 game by                                               1
creator: "Blondie"                                                      1
Name: job, Length: 36404, dtype: int64

\N                                                              23881833
["Self"]                                                         3518390
["Self - Host"]                                                  1409620
["Self - Guest"]                                                  266394
["Self - Presenter"]                                              241847
                                                                  ...
["Father Marc"]                                                        1
["Sofia Walkovski Hebb","Sofia Walkovski","Sofia Walkovska"]           1
["Lord Quentin Tearaway"]                                              1
["Jens","Volker"]                                                      1
["Kingston Ford - the City Slicker"]                                   1
Name: characters, Length: 2548483, dtype: int64

In [ ]:
# change columns name 'tconst' to 'title_id'

title_principals.rename(columns = {'tconst':'title_id'}, inplace = True)

title_principals.head()

    title_id  ordering  ...                      job characters
0  tt0000001         1  ...                       \N   ["Self"]
1  tt0000001         2  ...                       \N         \N
2  tt0000001         3  ...  director of photography         \N
3  tt0000002         1  ...                       \N         \N
4  tt0000002         2  ...                       \N         \N

[5 rows x 6 columns]

In [ ]:
#duplicates on title_id column
print(title_principals.title_id.duplicated(),'\n')

#count duplicates on a column
title_principals.title_id.duplicated().sum()

0           False
1            True
2            True
3           False
4            True
            ...
47440659     True
47440660     True
47440661     True
47440662     True
47440663     True
Name: title_id, Length: 47440664, dtype: bool

39845366

nconst - maybe join all 1's in a category call 'Others'

job - join all the elements that aren't real jobs (producer, writer, etc...) and create new category called 'Others jobs'

character - maybe join all SELF in a big category called 'SELF' or join the small categories in on category called 'Other_characters'

In [ ]:
#replace '\N' for 

#df['column name'] = df['column name'].str.replace('old character','new character')

#df = df.replace('old character','new character', regex=True)

## to replace '-1' value on the '\\N'
#episodes["seasonNumber"] = episodes.seasonNumber.apply(lambda item: "-1" if item == "\\N" else item)

title_principals.head

# Questions from the project that might can answer

In [ ]:
#Which actors are the most present? At what period?

In [ ]:
#Are the actors in the tv series the same as the films?